app/Controllers/Home.php

	 public function auth()
    {
        $session = session();
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'shafeed'
 LIMIT 1

	public function viewpcertificarte($id = null)
    {
$session = session();
$users_id = 0;
$users_id = $session->get('users_id');
if($users_id == 0)
{
	return redirect()->to('/');
}
else {
	 $model = new Evsave();

        $data['certificates'] = $model->where('certificate_id', $id)->first();
---
SELECT *
FROM `certificates`
WHERE `certificate_id` = '225'
 LIMIT 1